R1(config)#int fa0/0
R1(config-if)#ip add 192.168.0.254 255.255.255.0
R1(config-if)#no sh

R1(config)#int fa0/0
R1(config-if)#ip add 192.168.0.254 255.255.255.0
R1(config-if)#no sh

-------------------------------------------------

R2(config)#int se0/0
R2(config-if)#ip add 10.10.10.2 255.255.255.0
R2(config-if)#no sh

R2(config-if)#int se0/1
R2(config-if)#ip add 20.20.20.1 255.255.255.0
R2(config-if)#no sh

R2(config-if)#int se0/2
R2(config-if)#ip add 30.30.30.1 255.255.255.0
R2(config-if)#no sh

R2(config-if)#int se0/3
R2(config-if)#ip add 40.40.40.1 255.255.255.0
R2(config-if)#no sh

-------------------------------------------------

R3(config)#int fa0/0
R3(config-if)#ip add 100.100.100.254 255.255.255.0
R3(config-if)#no sh

R3(config-if)#int se0/0
R3(config-if)#ip add 20.20.20.2 255.255.255.0
R3(config-if)#no sh

-------------------------------------------------

R4(config)#int fa0/0
R4(config-if)#ip add 150.150.150.254 255.255.255.0
R4(config-if)#no sh
	
R4(config-if)#int se0/0
R4(config-if)#ip add 30.30.30.2 255.255.255.0
R4(config-if)#no sh

-------------------------------------------------

R5(config)#int fa0/0
R5(config-if)#ip add 200.200.200.254 255.255.255.0
R5(config-if)#no sh

R5(config-if)#int se0/0
R5(config-if)#ip add 40.40.40.2 255.255.255.0
R5(config-if)#no sh

-------------------------------------------------

R3(config)#ip route 192.168.0.0 255.255.255.0 se0/0

-------------------------------------------------

R4(config)#ip route 192.168.0.0 255.255.255.0 se0/0

-------------------------------------------------

R5(config)#ip route 192.168.0.0 255.255.255.0 se0/0

-------------------------------------------------

R2(config)#ip route 192.168.0.0 255.255.255.0 se0/0
R2(config)#ip route 100.100.100.0 255.255.255.0 se0/1
R2(config)#ip route 150.150.150.0 255.255.255.0 se0/2
R2(config)#ip route 200.200.200.0 255.255.255.0 se0/3

-------------------------------------------------

R1(config)#ip route 0.0.0.0 0.0.0.0 10.10.10.2
